package LesssonTwo;

public class Task3 {
    public static void main(String[] args) {
//Задание 3
//Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….

        int sequence2 = 95;
        while (sequence2 >= 5) {
            sequence2 = sequence2 - 5;
            System.out.println(sequence2);
        }
    }
}
